##########################################################################
# 项目名称：综合应用前置（MBP）项目
# 版    本：V1.0
# 操作系统：AIX4.3
# 文件描述：通道服务通用MAKEFILE
# 数 据 库:Informix 7(64) 
##########################################################################
# 修改记录
# 修改日期:
# 修改内容:
# 修改人:
##########################################################################
include $(GAPSSRCHOME)/etc/makefile.all
##########################################################################

all : test

test:test.o 
	${BACKUP_BIN}
	$(LINK_BIN)  ${LIB_CHANNEL}  $(LIB_HSCOMMON) ${LIB_BASE}
	#$(LINK_TUXLCLI) ${LIB_CHANNEL} ${LIB_MBPBASE} ${LIB_TUXLCLI}
:q

##########################################################################
